In [36]:
from sklearn.ensemble import RandomForestClassifier
import pandas as pd

In [43]:
csv = "clean_ml.csv"
df = pd.read_csv(csv, encoding="ISO-8859-1")
df = df.drop(['Unnamed: 0'], axis=1)

df.head()

,Mid-Career Median Salary,MORTGAGE,RENT,ELECTRICITY,GAS,EAT-IN,PHONE,HLTH & WELL,VET,REGION
0,6908.333333,688.216667,776.12,154.08,65.4,399.6,164.24,680.75,46.79,0
1,6725.000000,688.216667,776.12,154.08,65.4,399.6,164.24,680.75,46.79,0
2,6358.333333,721.952778,814.16,183.42,75.0,431.4,195.52,654.49,48.02,0
3,7033.333333,1286.791667,1451.00,156.76,82.5,431.1,167.10,790.34,55.28,2
4,6150.000000,1286.791667,1451.00,156.76,82.5,431.1,167.10,790.34,55.28,2

In [44]:
#df = df.drop(['School Name'],axis=1)

In [45]:
df.dtypes

Mid-Career Median Salary    float64
MORTGAGE                    float64
RENT                        float64
ELECTRICITY                 float64
GAS                         float64
EAT-IN                      float64
PHONE                       float64
HLTH & WELL                 float64
VET                         float64
REGION                        int64
dtype: object

In [46]:
df.head()

,Mid-Career Median Salary,MORTGAGE,RENT,ELECTRICITY,GAS,EAT-IN,PHONE,HLTH & WELL,VET,REGION
0,6908.333333,688.216667,776.12,154.08,65.4,399.6,164.24,680.75,46.79,0
1,6725.000000,688.216667,776.12,154.08,65.4,399.6,164.24,680.75,46.79,0
2,6358.333333,721.952778,814.16,183.42,75.0,431.4,195.52,654.49,48.02,0
3,7033.333333,1286.791667,1451.00,156.76,82.5,431.1,167.10,790.34,55.28,2
4,6150.000000,1286.791667,1451.00,156.76,82.5,431.1,167.10,790.34,55.28,2

In [47]:
# df.dtypes

# df.to_csv('ml.csv')

In [48]:
X = df.drop('REGION', axis=1)
y = df['REGION']

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20)

In [50]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier()
classifier.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [51]:
y_pred = classifier.predict(X_test)

In [52]:
from sklearn.metrics import classification_report, confusion_matrix
print(confusion_matrix(y_test, y_pred))
print(classification_report(y_test, y_pred))

[[6 2 0 0 0]
 [4 3 2 0 0]
 [1 1 4 0 1]
 [0 0 0 1 0]
 [0 0 0 0 4]]
              precision    recall  f1-score   support

           0       0.55      0.75      0.63         8
           1       0.50      0.33      0.40         9
           2       0.67      0.57      0.62         7
           3       1.00      1.00      1.00         1
           4       0.80      1.00      0.89         4

   micro avg       0.62      0.62      0.62        29
   macro avg       0.70      0.73      0.71        29
weighted avg       0.61      0.62      0.60        29